## Plan Result (demo-demo)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * module.demo-platform.azurerm_dns_zone.zone
  * module.demo-platform.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.demo-platform.azurerm_dns_zone.zone must be replaced
-/+ resource "azurerm_dns_zone" "zone" {
      ~ id                        = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/demo.platform.hmcts.net" -> (known after apply)
      ~ max_number_of_record_sets = 10000 -> (known after apply)
        name                      = "demo.platform.hmcts.net"
      ~ name_servers              = [
          - "ns1-02.azure-dns.com.",
          - "ns2-02.azure-dns.net.",
          - "ns3-02.azure-dns.org.",
          - "ns4-02.azure-dns.info.",
        ] -> (known after apply)
      ~ number_of_record_sets     = 202 -> (known after apply)
      ~ resource_group_name       = "reformMgmtRG" -> "reformmgmtrg" # forces replacement
      - tags                      = {} -> null

      - soa_record {
          - email         = "azuredns-hostmaster.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "demo.platform.hmcts.net." -> null
          - host_name     = "ns1-02.azure-dns.com." -> null
          - minimum_ttl   = 300 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.demo-platform.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/demo.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/96fdd39a-d7b9-f4d7-4f0a-96e04ac5d583" -> (known after apply)
      ~ name                             = "96fdd39a-d7b9-f4d7-4f0a-96e04ac5d583" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/demo.platform.hmcts.net" # forces replacement -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1175,"Program":"tfcmt","SHA1":"","Target":"demo-demo","Vars":{}} -->